Revit 2026 API

# IFCExtrusionCreationDataAddOpening Method

---

Adds an opening to the data.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddOpening(
	IFCExtrusionData data
)
```
```vb
Public Sub AddOpening (
	data As IFCExtrusionData
)
```
```cpp
public:
void AddOpening(
	IFCExtrusionData^ data
)
```
```fsharp
member AddOpening :
        data : IFCExtrusionData -> unit
```

#### Parameters

data IFCExtrusionData
     The opening.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The opening is stored for retrieval later via GetOpenings().

#### Reference

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace